app/views/albums/index.html.erb

              <td><%= link_to album.name, album_path(album.id) %></td>
              <td><%= album.photos.length %></td>
---
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = $1  [["album_id", 980190962]]