app/views/albums/index.json.jbuilder

SELECT COUNT(*) FROM "photos" WHERE "photos"."album_id" = $1  [["album_id", 980190962]]
---
    json.position album.position
    json.photos_count album.photos.size