app/views/albums/show.html.erb

  <div class="col-xs-12">
    <p>Contains <%= @album.photos.length %> photos.</p>
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`album_id` IN (1)