app/views/albums/show.json.jbuilder

  json.average_date @album.average_date
  json.photos_count @album.photos.size
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`album_id` IN (1)