app/controllers/albums_controller.rb

  def index
    @albums = Album.page params[:page]
---
SELECT  `albums`.* FROM `albums` LIMIT 10 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM `albums` LIMIT 10 OFFSET 0) subquery_for_count

  def edit
    @album = Album.includes(:photos).find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", 1]]
SELECT `photos`.* FROM `photos` WHERE `photos`.`album_id` IN (1)

  def show
    @album = Album.includes(:photos).where(id: params[:id]).first
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1  ORDER BY "albums"."id" ASC LIMIT 1  [["id", 1]]
SELECT `photos`.* FROM `photos` WHERE `photos`.`album_id` IN (1)

  def create
    @album = Album.new(album_params)
    if @album.save!
---
INSERT INTO "albums" ("name", "position", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "album"], ["position", 3], ["created_at", "2016-06-15 02:50:01.341777"], ["updated_at", "2016-06-15 02:50:01.341777"]]

  def update
    @album = Album.includes(:photos).find(params[:id])
    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", 1]]
SELECT `photos`.* FROM `photos` WHERE `photos`.`album_id` IN (1)
UPDATE "albums" SET "name" = $1, "position" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["name", "album"], ["position", 3], ["updated_at", "2016-06-15 02:54:35.061879"], ["id", 1]]