app/controllers/photos_controller.rb

  def show
    @photo = Photo.where(id: params[:id]).where(album_id: params[:album_id]).first
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 AND "photos"."album_id" = $2  ORDER BY "photos"."id" ASC LIMIT 1  [["id", 1], ["album_id", 1]]

  def edit
    @photo = Photo.where(id: params[:id]).where(album_id: params[:album_id]).first
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 AND "photos"."album_id" = $2  ORDER BY "photos"."id" ASC LIMIT 1  [["id", 1], ["album_id", 1]]

  def update
    @photo = Photo.where(id: params[:id]).where(album_id: params[:album_id]).first
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 AND "photos"."album_id" = $2  ORDER BY "photos"."id" ASC LIMIT 1  [["id", 1119], ["album_id", 19]]

  def destroy
    @photo = Photo.where(id: params[:id]).where(album_id: params[:album_id]).first
    if @photo.destroy
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 AND "photos"."album_id" = $2  ORDER BY "photos"."id" ASC LIMIT 1  [["id", 2863], ["album_id", 49]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 2863]]